ChipstackLTD/Zerobase/boards.txt
# USB support
ZEROBASE_2W.menu.usb.none=None
ZEROBASE_2W.menu.usb.none.build.usb_flags=
ZEROBASE_2W.menu.usb.tinyusb_usbd=Adafruit TinyUSB with USBD
ZEROBASE_2W.menu.usb.tinyusb_usbd.build.usb_flags=-DUSBCON -DUSE_TINYUSB -DCFG_TUD_WCH_USBIP_FSDEV=1 "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
ZEROBASE_2W.menu.usb.tinyusb_usbfs=Adafruit TinyUSB with USBFS
ZEROBASE_2W.menu.usb.tinyusb_usbfs.build.usb_flags=-DUSBCON -DUSE_TINYUSB -DCFG_TUD_WCH_USBIP_USBFS=1 "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"

# Upload menu
ZEROBASE_2W.menu.upload_method.ispMethod=WCH-ISP
ZEROBASE_2W.menu.upload_method.ispMethod.upload.protocol=
ZEROBASE_2W.menu.upload_method.ispMethod.upload.options=
ZEROBASE_2W.menu.upload_method.ispMethod.upload.tool=wchisp


# Clock Select
ZEROBASE_2W.menu.clock.144MHz_HSI=144MHz Internal
ZEROBASE_2W.menu.clock.144MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_144MHz_HSI=144000000 -DF_CPU=144000000
ZEROBASE_2W.menu.clock.120MHz_HSI=120MHz Internal
ZEROBASE_2W.menu.clock.120MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_120MHz_HSI=120000000 -DF_CPU=120000000
ZEROBASE_2W.menu.clock.96MHz_HSI=96MHz Internal
ZEROBASE_2W.menu.clock.96MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_96MHz_HSI=96000000 -DF_CPU=96000000
ZEROBASE_2W.menu.clock.72MHz_HSI=72MHz Internal
ZEROBASE_2W.menu.clock.72MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_72MHz_HSI=72000000 -DF_CPU=72000000
ZEROBASE_2W.menu.clock.56MHz_HSI=56MHz Internal
ZEROBASE_2W.menu.clock.56MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_56MHz_HSI=56000000 -DF_CPU=56000000
ZEROBASE_2W.menu.clock.48MHz_HSI=48MHz Internal
ZEROBASE_2W.menu.clock.48MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSI=48000000 -DF_CPU=48000000
ZEROBASE_2W.menu.clock.HSI=HSI Internal
ZEROBASE_2W.menu.clock.HSI.build.flags.clock=-DSYSCLK_FREQ_HSI=HSI_VALUE -DF_CPU=HSI_VALUE
ZEROBASE_2W.menu.clock.144MHz_HSE=144MHz External
ZEROBASE_2W.menu.clock.144MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_144MHz_HSE=144000000 -DF_CPU=144000000
ZEROBASE_2W.menu.clock.120MHz_HSE=120MHz External
ZEROBASE_2W.menu.clock.120MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_120MHz_HSE=120000000 -DF_CPU=120000000
ZEROBASE_2W.menu.clock.96MHz_HSE=96MHz External
ZEROBASE_2W.menu.clock.96MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_96MHz_HSE=96000000 -DF_CPU=96000000
ZEROBASE_2W.menu.clock.72MHz_HSE=72MHz External
ZEROBASE_2W.menu.clock.72MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_72MHz_HSE=72000000 -DF_CPU=72000000
ZEROBASE_2W.menu.clock.56MHz_HSE=56MHz External
ZEROBASE_2W.menu.clock.56MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_56MHz_HSE=56000000 -DF_CPU=56000000
ZEROBASE_2W.menu.clock.48MHz_HSE=48MHz External
ZEROBASE_2W.menu.clock.48MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSE=48000000 -DF_CPU=48000000
ZEROBASE_2W.menu.clock.HSE=HSE External
ZEROBASE_2W.menu.clock.HSE.build.flags.clock=-DSYSCLK_FREQ_HSE=HSE_VALUE -DF_CPU=HSE_VALUE


# Optimizations
ZEROBASE_2W.menu.opt.oslto=Smallest (-Os) with LTO
ZEROBASE_2W.menu.opt.oslto.build.flags.optimize=-Os -flto
ZEROBASE_2W.menu.opt.osstd=Smallest (-Os)
ZEROBASE_2W.menu.opt.osstd.build.flags.optimize=-Os
ZEROBASE_2W.menu.opt.o1std=Fast (-O1)
ZEROBASE_2W.menu.opt.o1std.build.flags.optimize=-O1
ZEROBASE_2W.menu.opt.o1lto=Fast (-O1) with LTO
ZEROBASE_2W.menu.opt.o1lto.build.flags.optimize=-O1 -flto
ZEROBASE_2W.menu.opt.o2std=Faster (-O2)
ZEROBASE_2W.menu.opt.o2std.build.flags.optimize=-O2
ZEROBASE_2W.menu.opt.o2lto=Faster (-O2) with LTO
ZEROBASE_2W.menu.opt.o2lto.build.flags.optimize=-O2 -flto
ZEROBASE_2W.menu.opt.o3std=Fastest (-O3)
ZEROBASE_2W.menu.opt.o3std.build.flags.optimize=-O3
ZEROBASE_2W.menu.opt.o3lto=Fastest (-O3) with LTO
ZEROBASE_2W.menu.opt.o3lto.build.flags.optimize=-O3 -flto
ZEROBASE_2W.menu.opt.ogstd=Debug (-Og)
ZEROBASE_2W.menu.opt.ogstd.build.flags.optimize=-Og
ZEROBASE_2W.menu.opt.o0std=No Optimization (-O0)
ZEROBASE_2W.menu.opt.o0std.build.flags.optimize=-O0


# Debug information
ZEROBASE_2W.menu.dbg.none=None
ZEROBASE_2W.menu.dbg.none.build.flags.debug=-DNDEBUG
ZEROBASE_2W.menu.dbg.enable_sym=Symbols Enabled (-g)
ZEROBASE_2W.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
ZEROBASE_2W.menu.dbg.enable_log=Core logs Enabled
ZEROBASE_2W.menu.dbg.enable_log.build.flags.debug=
ZEROBASE_2W.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
ZEROBASE_2W.menu.dbg.enable_all.build.flags.debug=-g


# C Runtime Library
ZEROBASE_2W.menu.rtlib.nano=Newlib Nano (default)
ZEROBASE_2W.menu.rtlib.nano.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs
ZEROBASE_2W.menu.rtlib.nanofp=Newlib Nano + Float Printf
ZEROBASE_2W.menu.rtlib.nanofp.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float
ZEROBASE_2W.menu.rtlib.nanofs=Newlib Nano + Float Scanf
ZEROBASE_2W.menu.rtlib.nanofs.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _scanf_float
ZEROBASE_2W.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
ZEROBASE_2W.menu.rtlib.nanofps.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float -u _scanf_float
ZEROBASE_2W.menu.rtlib.full=Newlib Standard
ZEROBASE_2W.menu.rtlib.full.build.flags.ldflags=--specs=nosys.specs